patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
bool csi_probe_observe(const csi_probe_phy_t *phy, uint32_t window_ms,
                       bool restart_source, csi_probe_result_t *out)
{
  uint32_t tickstart;
  bool     any_frame = false;

  if ((phy == NULL) || (out == NULL))
  {
    return false;
  }

  memset(out, 0, sizeof(*out));
  out->phy       = *phy;
  out->window_ms = window_ms;

  /* Poll everything: a mismatched bitrate produces one error per packet and the
     HAL handler would spend the whole window inside the ISR. */
  HAL_NVIC_DisableIRQ(CSI_IRQn);

  if (csi_probe_apply_phy(phy) != HAL_OK)
  {
    HAL_NVIC_EnableIRQ(CSI_IRQn);
    return false;
  }

  /* Accept every data type on every channel: the format is unknown at this
     point and filtering would hide the very packets we are looking for. */
  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc, DCMIPP_CSI_DT_BPP8);
  }

  /* Arm all four channels at once and watch the state flags inside the polling
     loop: waiting for each one in turn would cost a full timeout per absent
     channel, which dominates a sweep over dozens of settings. */
  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    SET_BIT(CSI->CR, vc_start_bit[vc]);
  }

  /* Receiver is fully up now; only then is it worth restarting the source - and
     only if the link is not already running. Asking a human to power-cycle
     something that is already transmitting is how a diagnostic tool gets
     abandoned. */
  if (restart_source)
  {
    if (g_phy_reapplied || ((CSI->SR1 & CSI_SR1_ACTCLF) == 0U))
    {
      out->source_boot_ms = csi_probe_source_cycle_wait(0U);
    }
    else
    {
      out->source_boot_ms = 1U;   /* already transmitting */
    }
  }

  /* Discard whatever accumulated while the channels were coming up. */
  CSI->FCR0 = 0xFFFFFFFFU;
  CSI->FCR1 = 0xFFFFFFFFU;

  tickstart = HAL_GetTick();
  while ((HAL_GetTick() - tickstart) < window_ms)
  {
    uint32_t sr0    = CSI->SR0;
    uint32_t sr1    = CSI->SR1;
    uint32_t clear0 = 0U;

    out->sr0 |= sr0;
    out->sr1 |= sr1;

    for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
    {
      if ((sr0 & (CSI_SR0_VC0STATEF << vc)) != 0U)
      {
        out->vc_state_mask |= (1UL << vc);
      }
      if ((sr0 & (CSI_SR0_SOF0F << vc)) != 0U)
      {
        out->sof[vc]++;
        clear0 |= (CSI_SR0_SOF0F << vc);
      }
      if ((sr0 & (CSI_SR0_EOF0F << vc)) != 0U)
      {
        out->eof[vc]++;
        clear0 |= (CSI_SR0_EOF0F << vc);
        any_frame = true;
      }
    }

    /* Counting errors rather than only flagging them is what makes neighbouring
       bitrate profiles comparable: a link can be up and still be marginal, and
       the difference only shows as a rate. */
    if ((sr0 & CSI_SR0_ECCERRF)  != 0U) { out->err_ecc++; }
    if ((sr0 & CSI_SR0_CECCERRF) != 0U) { out->err_ecc_corrected++; }
    if ((sr0 & CSI_SR0_CRCERRF)  != 0U) { out->err_crc++; }
    if ((sr1 & CSI_SR1_PHY_ERRORS) != 0U) { out->err_phy++; }

    /* Error flags are cleared as well, so the sticky OR reflects errors that
       kept coming rather than one latched at start-up. */
    CSI->FCR0 = clear0 | (sr0 & (CSI_SR0_LINK_ERRORS | CSI_SR0_CECCERRF | CSI_SR0_IDERRF));
    CSI->FCR1 = sr1 & CSI_SR1_PHY_ERRORS;
  }

  csi_stop_all_vc();
  HAL_NVIC_EnableIRQ(CSI_IRQn);

  return any_frame;
}

/* ------------------------------------------------------------------------- */
/* Sweep                                                                     */
/* ------------------------------------------------------------------------- */

/**
  * @brief  Render one channel's frame count into @p buf.
  * @note   "-" nothing, "12" twelve complete frames, "12!" twelve frames started
  *         but none finished - the difference between "no data" and "data that
  *         does not survive the link".
  */
static void csi_format_vc(char *buf, size_t len, uint32_t sof, uint32_t eof)
{
  if (eof != 0U)
  {
    (void)snprintf(buf, len, "%lu", (unsigned long)eof);
  }
  else if (sof != 0U)
  {
    (void)snprintf(buf, len, "%lu!", (unsigned long)sof);
  }
  else
  {
    (void)snprintf(buf, len, "-");
  }
}

static void csi_print_scan_row(const csi_probe_result_t *r)
{
  char vc_text[CSI_PROBE_VC_COUNT][12];

  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    csi_format_vc(vc_text[vc], sizeof(vc_text[vc]), r->sof[vc], r->eof[vc]);
  }

  /* The virtual channel state flag is deliberately not shown: it reports that a
     channel was started, not that anything arrived on it, so it reads "all four
     present" even on a dead link. The frame counts are the honest signal. */
  printf("  %4u  %u %s | clk %c  l0 %c%c  l1 %c%c | %5s %5s %5s %5s |",
         (unsigned)r->phy.mbps,
         (unsigned)r->phy.lanes,
         (r->phy.swapped != 0U) ? "swap" : "norm",
         ((r->sr1 & CSI_SR1_ACTCLF)   != 0U) ? 'A' : '-',
         ((r->sr1 & CSI_SR1_ACTDL0F)  != 0U) ? 'A' : '-',
         ((r->sr1 & CSI_SR1_SYNCDL0F) != 0U) ? 'S' : '-',
         ((r->sr1 & CSI_SR1_ACTDL1F)  != 0U) ? 'A' : '-',
         ((r->sr1 & CSI_SR1_SYNCDL1F) != 0U) ? 'S' : '-',
         vc_text[0], vc_text[1], vc_text[2], vc_text[3]);

  /* Counts, not just flags: a link can be up and still be marginal, and picking
     between neighbouring bitrate profiles is a comparison of rates. */
  printf(" %3lu %3lu %3lu", (unsigned long)r->err_ecc, (unsigned long)r->err_crc,
         (unsigned long)r->err_phy);

  if ((r->sr0 & CSI_SR0_SYNCERRF) != 0U) { printf(" SYNC"); }
  if ((r->sr0 & CSI_SR0_WDERRF)   != 0U) { printf(" WDG"); }
  if ((r->sr0 & CSI_SR0_SPKTERRF) != 0U) { printf(" SPKT"); }
  printf("\n");
}

static uint32_t csi_result_frames(const csi_probe_result_t *r)
{
  return r->eof[0] + r->eof[1] + r->eof[2] + r->eof[3];
}

bool csi_probe_scan(uint32_t window_ms, bool restart_source, csi_probe_phy_t *best)
{
  csi_probe_result_t result;
  csi_probe_phy_t    winner       = {0};
  uint32_t           best_frames  = 0U;
  uint32_t           best_errors  = 0xFFFFFFFFU;
  bool               best_clean   = false;
  bool               found        = false;
  bool               clock_seen   = false;
  uint32_t           combinations = CSI_SCAN_MBPS_COUNT * 4U;

  if (restart_source && (g_source_mode == CSI_SOURCE_MANUAL))
  {
    /* One prompt per combination is not a workflow. Fall back to a single
       restart up front and say so. */
    printf("CSI: source mode is manual, so a restart per combination would mean %lu\n"
           "     power-cycles by hand. Doing one up front instead; 'refine' is the\n"
           "     command for comparing a handful of profiles properly.\n",
           (unsigned long)combinations);
    restart_source = false;
  }

  printf("CSI: scanning %u bitrates x 2 lane counts x 2 mappings, %lu ms each%s\n",
         (unsigned)CSI_SCAN_MBPS_COUNT, (unsigned long)window_ms,
         restart_source ? ", restarting the source each time" : "");

  if (restart_source)
  {
    /* Each iteration pays for the reset sequence plus the source's boot time,
       and that boot time was measured in seconds, not milliseconds. */
    printf("CSI: this restarts the source %lu times; expect several minutes\n",
           (unsigned long)combinations);
  }
  else
  {
    /* One restart up front, then sweep against a transmitter that keeps running.
       Whether it survives the receiver resets in between is exactly what the
       table will show: if only the first rows carry frames, it does not, and the
       sweep is not a usable instrument for this source. */
    uint32_t boot_ms;

    printf("CSI: starting the source once, then sweeping without restarting it\n");
    HAL_NVIC_DisableIRQ(CSI_IRQn);
    boot_ms = csi_probe_source_cycle_wait(0U);
    HAL_NVIC_EnableIRQ(CSI_IRQn);

    if (boot_ms == 0U)
    {
      printf("CSI: the source never produced a clock; nothing to sweep against.\n");
      return false;
    }
    printf("CSI: source transmitting after %lu ms\n", (unsigned long)(boot_ms - 1U));
  }

  printf("  mbps  ln map  | dphy activity      | frames per vc (! = no end of frame) | ecc crc phy\n");

  for (uint32_t lanes = 2U; lanes >= 1U; lanes--)
  {
    for (uint32_t swapped = 0U; swapped <= 1U; swapped++)
    {
      for (uint32_t i = 0U; i < CSI_SCAN_MBPS_COUNT; i++)
      {
        csi_probe_phy_t phy;
        uint32_t        frames;
        uint32_t        errors;
        bool            clean;

        phy.mbps    = csi_scan_mbps[i];
        phy.lanes   = (uint8_t)lanes;
        phy.swapped = (uint8_t)swapped;

        (void)csi_probe_observe(&phy, window_ms, restart_source, &result);

