patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
  if (phy == NULL)
  {
    return false;
  }

  centre_idx = csi_probe_bitrate_profile(phy->mbps, NULL);
  first_idx  = (centre_idx > neighbours) ? (centre_idx - neighbours) : 0U;
  last_idx   = centre_idx + neighbours;
  if (last_idx >= CSI_PHY_PROFILE_COUNT)
  {
    last_idx = CSI_PHY_PROFILE_COUNT - 1U;
  }

  printf("CSI: comparing profiles %u..%u Mbit/s around %u, %u lane(s), %s mapping\n",
         (unsigned)csi_phy_profile_mbps[first_idx],
         (unsigned)csi_phy_profile_mbps[last_idx],
         (unsigned)phy->mbps, (unsigned)phy->lanes,
         (phy->swapped != 0U) ? "inverted" : "physical");
  printf("CSI: %lu profiles, each needs the source restarted\n",
         (unsigned long)((last_idx - first_idx) + 1U));
  printf("  mbps  | frames per vc (! = no end of frame) | ecc crc phy\n");

  for (uint32_t idx = first_idx; idx <= last_idx; idx++)
  {
    csi_probe_phy_t candidate = *phy;
    char            vc_text[CSI_PROBE_VC_COUNT][12];
    uint32_t        frames;
    uint32_t        errors;

    candidate.mbps = csi_phy_profile_mbps[idx];

    (void)csi_probe_observe(&candidate, window_ms, true, &result);

    if (result.source_boot_ms == 0U)
    {
      printf("  %4u  | source did not start\n", (unsigned)candidate.mbps);
      continue;
    }

    for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
    {
      csi_format_vc(vc_text[vc], sizeof(vc_text[vc]), result.sof[vc], result.eof[vc]);
    }

    frames = csi_result_frames(&result);
    errors = result.err_ecc + result.err_crc + result.err_phy;

    printf("  %4u  | %5s %5s %5s %5s | %3lu %3lu %3lu\n",
           (unsigned)candidate.mbps,
           vc_text[0], vc_text[1], vc_text[2], vc_text[3],
           (unsigned long)result.err_ecc, (unsigned long)result.err_crc,
           (unsigned long)result.err_phy);

    if (frames == 0U)
    {
      continue;
    }
    found = true;

    /* Frames first, then quietness - the same ranking the sweep uses, which is
       what makes the two comparable. */
    if ((frames > best_frames) || ((frames == best_frames) && (errors < best_errors)))
    {
      best_frames = frames;
      best_errors = errors;
      winner      = candidate;
    }
  }

  if (!found)
  {
    printf("CSI: no profile in that range delivered a frame\n");
    return false;
  }

  printf("CSI: quietest is %u Mbit/s (%lu frames, %lu errors)\n",
         (unsigned)winner.mbps, (unsigned long)best_frames, (unsigned long)best_errors);
  *phy = winner;
  return true;
}

/* ------------------------------------------------------------------------- */
/* Data type identification                                                  */
/* ------------------------------------------------------------------------- */

void csi_probe_datatypes(uint32_t vc, uint32_t window_ms, csi_probe_vc_info_t *info)
{
  DCMIPP_CSI_VCFilteringConfTypeDef filter = {0};
  uint32_t tickstart;
  static uint32_t dt_count[CSI_PROBE_DT_COUNT];   /* static: 256 B off the stack */

  if ((info == NULL) || (vc >= CSI_PROBE_VC_COUNT))
  {
    return;
  }

  info->dt_mask_lo = 0U;
  info->dt_mask_hi = 0U;
  info->image_dt   = 0U;
  memset(dt_count, 0, sizeof(dt_count));

  HAL_NVIC_DisableIRQ(CSI_IRQn);
  csi_stop_all_vc();

  /* Narrow the filter to a data type nothing can be sending. Every real packet
     then raises an ID error and CSI_ERR1 names the data type that arrived. */
  filter.DataTypeNB        = 1U;
  filter.DataTypeClass[0]  = CSI_PROBE_IMPOSSIBLE_DT;
  filter.DataTypeFormat[0] = DCMIPP_CSI_DT_BPP8;
  (void)HAL_DCMIPP_CSI_SetVCFilteringConfig(&hcamera_dcmipp, vc, &filter);

  if (!csi_start_vc(vc, 150U))
  {
    printf("CSI: VC%lu did not report the active state; identifying anyway\n",
           (unsigned long)vc);
  }

  CSI->FCR0 = 0xFFFFFFFFU;

  tickstart = HAL_GetTick();
  while ((HAL_GetTick() - tickstart) < window_ms)
  {
    if ((CSI->SR0 & CSI_SR0_IDERRF) != 0U)
    {
      uint32_t err1   = CSI->ERR1;
      uint32_t err_dt = (err1 & CSI_ERR1_IDDTERR) >> CSI_ERR1_IDDTERR_Pos;
      uint32_t err_vc = (err1 & CSI_ERR1_IDVCERR) >> CSI_ERR1_IDVCERR_Pos;

      /* ERR1 only holds the most recent offender, so the loop samples it as
         fast as it can and accumulates the set of data types it ever saw. */
      CSI->FCR0 = CSI_SR0_IDERRF;

      if (err_vc == vc)
      {
        if (err_dt < 32U)
        {
          info->dt_mask_lo |= (1UL << err_dt);
        }
        else
        {
          info->dt_mask_hi |= (1UL << (err_dt - 32U));
        }
        if (dt_count[err_dt] < 0xFFFFFFFFU)
        {
          dt_count[err_dt]++;
        }
      }
    }
  }

  csi_stop_all_vc();

  /* Put the channel back to "accept everything" so nothing downstream trips
     over a filter the probe left behind. */
  (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc, DCMIPP_CSI_DT_BPP8);
  HAL_NVIC_EnableIRQ(CSI_IRQn);

  /* The image data type is the long-packet type that arrived most often.
     Picking the lowest-numbered one instead would be wrong on a marginal link:
     an ECC error the receiver cannot correct turns a data type into a
     neighbouring value, and RAW10 (0x2b) corrupted into 0x2f is indistinguishable
     from a genuine data type on a single observation. The real one dominates by
     orders of magnitude, a corrupted one appears a handful of times. */
  {
    uint32_t best_count = 0U;

    for (uint32_t dt = 0U; dt < CSI_PROBE_DT_COUNT; dt++)
    {
      if (dt_is_image(dt) && (dt_count[dt] > best_count))
      {
        best_count     = dt_count[dt];
        info->image_dt = dt;
      }
    }
    info->image_dt_count = best_count;

    /* Anything else that looked like an image type is header corruption, and
       saying so is more useful than silently dropping it. */
    info->dt_corrupt = 0U;
    for (uint32_t dt = 0U; dt < CSI_PROBE_DT_COUNT; dt++)
    {
      if (dt_is_image(dt) && (dt != info->image_dt) && (dt_count[dt] != 0U))
      {
        info->dt_corrupt += dt_count[dt];
      }
    }
  }
}

/* ------------------------------------------------------------------------- */
/* Geometry                                                                  */
/* ------------------------------------------------------------------------- */

/**
  * @brief  Does virtual channel @p vc reach (@p line, @p byte) inside one frame?
  * @note   Uses CSI line/byte counter 0, which only raises a status flag. No
  *         DCMIPP pipe is involved, so an unknown resolution cannot overrun any
  *         buffer - that is the whole reason the geometry is measured this way.
  */
static bool csi_reaches(uint32_t vc, uint32_t line, uint32_t byte, uint32_t timeout_ms)
{
  DCMIPP_CSI_LineByteCounterConfTypeDef cnt = {0};
  uint32_t tickstart;
  bool     reached = false;

  cnt.VirtualChannel = vc;
  cnt.LineCounter    = line;
  cnt.ByteCounter    = byte;
  (void)HAL_DCMIPP_CSI_SetLineByteCounterConfig(&hcamera_dcmipp, DCMIPP_CSI_COUNTER0, &cnt);

